hi @YakDriver , rebased, conflicts resolved, acceptance tests are still fine.
```
13:19 $ TF_ACC=1 go test ./aws -v -count 1 -parallel 4 -run="TestAccAWSInstance_" -timeout 120m
=== RUN   TestAccAWSInstance_inDefaultVpcBySgName
=== PAUSE TestAccAWSInstance_inDefaultVpcBySgName
=== RUN   TestAccAWSInstance_inDefaultVpcBySgId
=== PAUSE TestAccAWSInstance_inDefaultVpcBySgId
=== RUN   TestAccAWSInstance_inEc2Classic
=== PAUSE TestAccAWSInstance_inEc2Classic
=== RUN   TestAccAWSInstance_basic
=== PAUSE TestAccAWSInstance_basic
=== RUN   TestAccAWSInstance_atLeastOneOtherEbsVolume
=== PAUSE TestAccAWSInstance_atLeastOneOtherEbsVolume
=== RUN   TestAccAWSInstance_EbsBlockDevice_KmsKeyArn
=== PAUSE TestAccAWSInstance_EbsBlockDevice_KmsKeyArn
=== RUN   TestAccAWSInstance_EbsBlockDevice_InvalidIopsForVolumeType
=== PAUSE TestAccAWSInstance_EbsBlockDevice_InvalidIopsForVolumeType
=== RUN   TestAccAWSInstance_RootBlockDevice_KmsKeyArn
=== PAUSE TestAccAWSInstance_RootBlockDevice_KmsKeyArn
=== RUN   TestAccAWSInstance_userDataBase64
=== PAUSE TestAccAWSInstance_userDataBase64
=== RUN   TestAccAWSInstance_GP2IopsDevice
=== PAUSE TestAccAWSInstance_GP2IopsDevice
=== RUN   TestAccAWSInstance_GP2WithIopsValue
=== PAUSE TestAccAWSInstance_GP2WithIopsValue
=== RUN   TestAccAWSInstance_blockDevices
=== PAUSE TestAccAWSInstance_blockDevices
=== RUN   TestAccAWSInstance_rootInstanceStore
=== PAUSE TestAccAWSInstance_rootInstanceStore
=== RUN   TestAccAWSInstance_noAMIEphemeralDevices
=== PAUSE TestAccAWSInstance_noAMIEphemeralDevices
=== RUN   TestAccAWSInstance_sourceDestCheck
=== PAUSE TestAccAWSInstance_sourceDestCheck
=== RUN   TestAccAWSInstance_disableApiTermination
=== PAUSE TestAccAWSInstance_disableApiTermination
=== RUN   TestAccAWSInstance_vpc
=== PAUSE TestAccAWSInstance_vpc
=== RUN   TestAccAWSInstance_outpost
=== PAUSE TestAccAWSInstance_outpost
=== RUN   TestAccAWSInstance_placementGroup
=== PAUSE TestAccAWSInstance_placementGroup
=== RUN   TestAccAWSInstance_ipv6_supportAddressCount
=== PAUSE TestAccAWSInstance_ipv6_supportAddressCount
=== RUN   TestAccAWSInstance_ipv6AddressCountAndSingleAddressCausesError
=== PAUSE TestAccAWSInstance_ipv6AddressCountAndSingleAddressCausesError
=== RUN   TestAccAWSInstance_ipv6_supportAddressCountWithIpv4
=== PAUSE TestAccAWSInstance_ipv6_supportAddressCountWithIpv4
=== RUN   TestAccAWSInstance_multipleRegions
=== PAUSE TestAccAWSInstance_multipleRegions
=== RUN   TestAccAWSInstance_NetworkInstanceSecurityGroups
=== PAUSE TestAccAWSInstance_NetworkInstanceSecurityGroups
=== RUN   TestAccAWSInstance_NetworkInstanceRemovingAllSecurityGroups
=== PAUSE TestAccAWSInstance_NetworkInstanceRemovingAllSecurityGroups
=== RUN   TestAccAWSInstance_NetworkInstanceVPCSecurityGroupIDs
=== PAUSE TestAccAWSInstance_NetworkInstanceVPCSecurityGroupIDs
=== RUN   TestAccAWSInstance_tags
=== PAUSE TestAccAWSInstance_tags
=== RUN   TestAccAWSInstance_volumeTags
=== PAUSE TestAccAWSInstance_volumeTags
=== RUN   TestAccAWSInstance_volumeTagsComputed
=== PAUSE TestAccAWSInstance_volumeTagsComputed
=== RUN   TestAccAWSInstance_instanceProfileChange
=== PAUSE TestAccAWSInstance_instanceProfileChange
=== RUN   TestAccAWSInstance_withIamInstanceProfile
=== PAUSE TestAccAWSInstance_withIamInstanceProfile
=== RUN   TestAccAWSInstance_privateIP
=== PAUSE TestAccAWSInstance_privateIP
=== RUN   TestAccAWSInstance_associatePublicIPAndPrivateIP
=== PAUSE TestAccAWSInstance_associatePublicIPAndPrivateIP
=== RUN   TestAccAWSInstance_Empty_PrivateIP
=== PAUSE TestAccAWSInstance_Empty_PrivateIP
=== RUN   TestAccAWSInstance_keyPairCheck
=== PAUSE TestAccAWSInstance_keyPairCheck
=== RUN   TestAccAWSInstance_rootBlockDeviceMismatch
=== PAUSE TestAccAWSInstance_rootBlockDeviceMismatch
=== RUN   TestAccAWSInstance_forceNewAndTagsDrift
=== PAUSE TestAccAWSInstance_forceNewAndTagsDrift
=== RUN   TestAccAWSInstance_changeInstanceType
=== PAUSE TestAccAWSInstance_changeInstanceType
=== RUN   TestAccAWSInstance_EbsRootDevice_basic
=== PAUSE TestAccAWSInstance_EbsRootDevice_basic
=== RUN   TestAccAWSInstance_EbsRootDevice_ModifySize
=== PAUSE TestAccAWSInstance_EbsRootDevice_ModifySize
=== RUN   TestAccAWSInstance_EbsRootDevice_ModifyType
=== PAUSE TestAccAWSInstance_EbsRootDevice_ModifyType
=== RUN   TestAccAWSInstance_EbsRootDevice_ModifyIOPS_Io1
=== PAUSE TestAccAWSInstance_EbsRootDevice_ModifyIOPS_Io1
=== RUN   TestAccAWSInstance_EbsRootDevice_ModifyIOPS_Io2
=== PAUSE TestAccAWSInstance_EbsRootDevice_ModifyIOPS_Io2
=== RUN   TestAccAWSInstance_EbsRootDevice_ModifyDeleteOnTermination
=== PAUSE TestAccAWSInstance_EbsRootDevice_ModifyDeleteOnTermination
=== RUN   TestAccAWSInstance_EbsRootDevice_ModifyAll
=== PAUSE TestAccAWSInstance_EbsRootDevice_ModifyAll
=== RUN   TestAccAWSInstance_EbsRootDevice_MultipleBlockDevices_ModifySize
=== PAUSE TestAccAWSInstance_EbsRootDevice_MultipleBlockDevices_ModifySize
=== RUN   TestAccAWSInstance_EbsRootDevice_MultipleBlockDevices_ModifyDeleteOnTermination
=== PAUSE TestAccAWSInstance_EbsRootDevice_MultipleBlockDevices_ModifyDeleteOnTermination
=== RUN   TestAccAWSInstance_EbsRootDevice_MultipleDynamicEBSBlockDevices
=== PAUSE TestAccAWSInstance_EbsRootDevice_MultipleDynamicEBSBlockDevices
=== RUN   TestAccAWSInstance_primaryNetworkInterface
=== PAUSE TestAccAWSInstance_primaryNetworkInterface
=== RUN   TestAccAWSInstance_primaryNetworkInterfaceSourceDestCheck
=== PAUSE TestAccAWSInstance_primaryNetworkInterfaceSourceDestCheck
=== RUN   TestAccAWSInstance_addSecondaryInterface
=== PAUSE TestAccAWSInstance_addSecondaryInterface
=== RUN   TestAccAWSInstance_addSecurityGroupNetworkInterface
=== PAUSE TestAccAWSInstance_addSecurityGroupNetworkInterface
=== RUN   TestAccAWSInstance_NewNetworkInterface_PublicIPAndSecondaryPrivateIPs
=== PAUSE TestAccAWSInstance_NewNetworkInterface_PublicIPAndSecondaryPrivateIPs
=== RUN   TestAccAWSInstance_NewNetworkInterface_EmptyPrivateIPAndSecondaryPrivateIPs
=== PAUSE TestAccAWSInstance_NewNetworkInterface_EmptyPrivateIPAndSecondaryPrivateIPs
=== RUN   TestAccAWSInstance_NewNetworkInterface_EmptyPrivateIPAndSecondaryPrivateIPsUpdate
=== PAUSE TestAccAWSInstance_NewNetworkInterface_EmptyPrivateIPAndSecondaryPrivateIPsUpdate
=== RUN   TestAccAWSInstance_NewNetworkInterface_PrivateIPAndSecondaryPrivateIPs
=== PAUSE TestAccAWSInstance_NewNetworkInterface_PrivateIPAndSecondaryPrivateIPs
=== RUN   TestAccAWSInstance_NewNetworkInterface_PrivateIPAndSecondaryPrivateIPsUpdate
=== PAUSE TestAccAWSInstance_NewNetworkInterface_PrivateIPAndSecondaryPrivateIPsUpdate
=== RUN   TestAccAWSInstance_associatePublic_defaultPrivate
=== PAUSE TestAccAWSInstance_associatePublic_defaultPrivate
=== RUN   TestAccAWSInstance_associatePublic_defaultPublic
=== PAUSE TestAccAWSInstance_associatePublic_defaultPublic
=== RUN   TestAccAWSInstance_associatePublic_explicitPublic
=== PAUSE TestAccAWSInstance_associatePublic_explicitPublic
=== RUN   TestAccAWSInstance_associatePublic_explicitPrivate
=== PAUSE TestAccAWSInstance_associatePublic_explicitPrivate
=== RUN   TestAccAWSInstance_associatePublic_overridePublic
=== PAUSE TestAccAWSInstance_associatePublic_overridePublic
=== RUN   TestAccAWSInstance_associatePublic_overridePrivate
=== PAUSE TestAccAWSInstance_associatePublic_overridePrivate
=== RUN   TestAccAWSInstance_getPasswordData_falseToTrue
=== PAUSE TestAccAWSInstance_getPasswordData_falseToTrue
=== RUN   TestAccAWSInstance_getPasswordData_trueToFalse
=== PAUSE TestAccAWSInstance_getPasswordData_trueToFalse
=== RUN   TestAccAWSInstance_CreditSpecification_Empty_NonBurstable
=== PAUSE TestAccAWSInstance_CreditSpecification_Empty_NonBurstable
=== RUN   TestAccAWSInstance_CreditSpecification_UnspecifiedToEmpty_NonBurstable
=== PAUSE TestAccAWSInstance_CreditSpecification_UnspecifiedToEmpty_NonBurstable
=== RUN   TestAccAWSInstance_creditSpecification_unspecifiedDefaultsToStandard
=== PAUSE TestAccAWSInstance_creditSpecification_unspecifiedDefaultsToStandard
=== RUN   TestAccAWSInstance_creditSpecification_standardCpuCredits
=== PAUSE TestAccAWSInstance_creditSpecification_standardCpuCredits
=== RUN   TestAccAWSInstance_creditSpecification_unlimitedCpuCredits
=== PAUSE TestAccAWSInstance_creditSpecification_unlimitedCpuCredits
=== RUN   TestAccAWSInstance_creditSpecification_unknownCpuCredits_t2
=== PAUSE TestAccAWSInstance_creditSpecification_unknownCpuCredits_t2
=== RUN   TestAccAWSInstance_creditSpecification_unknownCpuCredits_t3
=== PAUSE TestAccAWSInstance_creditSpecification_unknownCpuCredits_t3
=== RUN   TestAccAWSInstance_creditSpecification_updateCpuCredits
=== PAUSE TestAccAWSInstance_creditSpecification_updateCpuCredits
=== RUN   TestAccAWSInstance_creditSpecification_isNotAppliedToNonBurstable
=== PAUSE TestAccAWSInstance_creditSpecification_isNotAppliedToNonBurstable
=== RUN   TestAccAWSInstance_creditSpecificationT3_unspecifiedDefaultsToUnlimited
=== PAUSE TestAccAWSInstance_creditSpecificationT3_unspecifiedDefaultsToUnlimited
=== RUN   TestAccAWSInstance_creditSpecificationT3_standardCpuCredits
=== PAUSE TestAccAWSInstance_creditSpecificationT3_standardCpuCredits
=== RUN   TestAccAWSInstance_creditSpecificationT3_unlimitedCpuCredits
=== PAUSE TestAccAWSInstance_creditSpecificationT3_unlimitedCpuCredits
=== RUN   TestAccAWSInstance_creditSpecificationT3_updateCpuCredits
=== PAUSE TestAccAWSInstance_creditSpecificationT3_updateCpuCredits
=== RUN   TestAccAWSInstance_creditSpecification_standardCpuCredits_t2Tot3Taint
=== PAUSE TestAccAWSInstance_creditSpecification_standardCpuCredits_t2Tot3Taint
=== RUN   TestAccAWSInstance_creditSpecification_unlimitedCpuCredits_t2Tot3Taint
=== PAUSE TestAccAWSInstance_creditSpecification_unlimitedCpuCredits_t2Tot3Taint
=== RUN   TestAccAWSInstance_disappears
=== PAUSE TestAccAWSInstance_disappears
=== RUN   TestAccAWSInstance_UserData_EmptyStringToUnspecified
=== PAUSE TestAccAWSInstance_UserData_EmptyStringToUnspecified
=== RUN   TestAccAWSInstance_UserData_UnspecifiedToEmptyString
=== PAUSE TestAccAWSInstance_UserData_UnspecifiedToEmptyString
=== RUN   TestAccAWSInstance_hibernation
=== PAUSE TestAccAWSInstance_hibernation
=== RUN   TestAccAWSInstance_metadataOptions
=== PAUSE TestAccAWSInstance_metadataOptions
=== CONT  TestAccAWSInstance_inDefaultVpcBySgName
=== CONT  TestAccAWSInstance_EbsRootDevice_ModifyDeleteOnTermination
=== CONT  TestAccAWSInstance_multipleRegions
=== CONT  TestAccAWSInstance_Empty_PrivateIP
--- PASS: TestAccAWSInstance_inDefaultVpcBySgName (107.85s)
=== CONT  TestAccAWSInstance_EbsRootDevice_ModifyIOPS_Io2
--- PASS: TestAccAWSInstance_Empty_PrivateIP (121.26s)
=== CONT  TestAccAWSInstance_EbsRootDevice_ModifyIOPS_Io1
--- PASS: TestAccAWSInstance_EbsRootDevice_ModifyDeleteOnTermination (121.99s)
=== CONT  TestAccAWSInstance_EbsRootDevice_ModifyType
--- PASS: TestAccAWSInstance_multipleRegions (165.57s)
=== CONT  TestAccAWSInstance_EbsRootDevice_ModifySize
--- PASS: TestAccAWSInstance_EbsRootDevice_ModifyIOPS_Io1 (138.93s)
=== CONT  TestAccAWSInstance_EbsRootDevice_basic
--- PASS: TestAccAWSInstance_EbsRootDevice_ModifyType (141.14s)
=== CONT  TestAccAWSInstance_changeInstanceType
--- PASS: TestAccAWSInstance_EbsRootDevice_ModifySize (140.91s)
=== CONT  TestAccAWSInstance_forceNewAndTagsDrift
--- PASS: TestAccAWSInstance_EbsRootDevice_basic (82.00s)
=== CONT  TestAccAWSInstance_rootBlockDeviceMismatch
    provider_test.go:557: skipping tests; AWS_DEFAULT_REGION (us-east-1) does not equal us-west-2
--- SKIP: TestAccAWSInstance_rootBlockDeviceMismatch (1.48s)
=== CONT  TestAccAWSInstance_keyPairCheck
=== CONT  TestAccAWSInstance_forceNewAndTagsDrift
    resource_aws_instance_test.go:1454: [INFO] Got non-empty plan, as expected
--- PASS: TestAccAWSInstance_EbsRootDevice_ModifyIOPS_Io2 (257.58s)
=== CONT  TestAccAWSInstance_volumeTagsComputed
--- PASS: TestAccAWSInstance_keyPairCheck (98.90s)
=== CONT  TestAccAWSInstance_associatePublicIPAndPrivateIP
--- PASS: TestAccAWSInstance_changeInstanceType (184.96s)
=== CONT  TestAccAWSInstance_privateIP
--- PASS: TestAccAWSInstance_forceNewAndTagsDrift (193.34s)
=== CONT  TestAccAWSInstance_getPasswordData_falseToTrue
--- PASS: TestAccAWSInstance_volumeTagsComputed (178.47s)
=== CONT  TestAccAWSInstance_associatePublic_overridePrivate
--- PASS: TestAccAWSInstance_privateIP (109.90s)
=== CONT  TestAccAWSInstance_withIamInstanceProfile
--- PASS: TestAccAWSInstance_associatePublicIPAndPrivateIP (120.91s)
=== CONT  TestAccAWSInstance_associatePublic_overridePublic
--- PASS: TestAccAWSInstance_associatePublic_overridePrivate (104.02s)
=== CONT  TestAccAWSInstance_instanceProfileChange
--- PASS: TestAccAWSInstance_getPasswordData_falseToTrue (154.38s)
=== CONT  TestAccAWSInstance_associatePublic_explicitPrivate
=== CONT  TestAccAWSInstance_creditSpecificationT3_standardCpuCredits
--- PASS: TestAccAWSInstance_associatePublic_overridePublic (114.12s)
--- PASS: TestAccAWSInstance_withIamInstanceProfile (152.30s)
=== CONT  TestAccAWSInstance_associatePublic_explicitPublic
--- PASS: TestAccAWSInstance_associatePublic_explicitPrivate (125.01s)
=== CONT  TestAccAWSInstance_metadataOptions
--- PASS: TestAccAWSInstance_associatePublic_explicitPublic (115.38s)
=== CONT  TestAccAWSInstance_associatePublic_defaultPublic
--- PASS: TestAccAWSInstance_creditSpecificationT3_standardCpuCredits (172.13s)
=== CONT  TestAccAWSInstance_hibernation
--- PASS: TestAccAWSInstance_instanceProfileChange (253.99s)
=== CONT  TestAccAWSInstance_associatePublic_defaultPrivate
--- PASS: TestAccAWSInstance_associatePublic_defaultPublic (126.58s)
=== CONT  TestAccAWSInstance_getPasswordData_trueToFalse
--- PASS: TestAccAWSInstance_metadataOptions (183.89s)
=== CONT  TestAccAWSInstance_creditSpecificationT3_unspecifiedDefaultsToUnlimited
--- PASS: TestAccAWSInstance_associatePublic_defaultPrivate (103.92s)
=== CONT  TestAccAWSInstance_creditSpecification_isNotAppliedToNonBurstable
--- PASS: TestAccAWSInstance_creditSpecificationT3_unspecifiedDefaultsToUnlimited (124.44s)
=== CONT  TestAccAWSInstance_creditSpecification_updateCpuCredits
--- PASS: TestAccAWSInstance_hibernation (264.60s)
=== CONT  TestAccAWSInstance_UserData_UnspecifiedToEmptyString
--- PASS: TestAccAWSInstance_creditSpecification_isNotAppliedToNonBurstable (133.18s)
=== CONT  TestAccAWSInstance_NewNetworkInterface_PrivateIPAndSecondaryPrivateIPsUpdate
--- PASS: TestAccAWSInstance_getPasswordData_trueToFalse (203.95s)
=== CONT  TestAccAWSInstance_UserData_EmptyStringToUnspecified
--- PASS: TestAccAWSInstance_UserData_UnspecifiedToEmptyString (140.60s)
=== CONT  TestAccAWSInstance_disappears
--- PASS: TestAccAWSInstance_creditSpecification_updateCpuCredits (186.52s)
=== CONT  TestAccAWSInstance_creditSpecification_unlimitedCpuCredits_t2Tot3Taint
--- PASS: TestAccAWSInstance_UserData_EmptyStringToUnspecified (130.41s)
=== CONT  TestAccAWSInstance_creditSpecification_standardCpuCredits_t2Tot3Taint
--- PASS: TestAccAWSInstance_NewNetworkInterface_PrivateIPAndSecondaryPrivateIPsUpdate (215.48s)
=== CONT  TestAccAWSInstance_creditSpecificationT3_updateCpuCredits
=== CONT  TestAccAWSInstance_disappears
    resource_aws_instance_test.go:3006: [INFO] Got non-empty plan, as expected
--- PASS: TestAccAWSInstance_disappears (110.73s)
=== CONT  TestAccAWSInstance_creditSpecificationT3_unlimitedCpuCredits
--- PASS: TestAccAWSInstance_creditSpecification_standardCpuCredits_t2Tot3Taint (215.86s)
=== CONT  TestAccAWSInstance_NewNetworkInterface_PrivateIPAndSecondaryPrivateIPs
--- PASS: TestAccAWSInstance_creditSpecificationT3_updateCpuCredits (187.36s)
=== CONT  TestAccAWSInstance_primaryNetworkInterfaceSourceDestCheck
--- PASS: TestAccAWSInstance_creditSpecificationT3_unlimitedCpuCredits (178.11s)
=== CONT  TestAccAWSInstance_primaryNetworkInterface
--- PASS: TestAccAWSInstance_primaryNetworkInterfaceSourceDestCheck (120.76s)
=== CONT  TestAccAWSInstance_NewNetworkInterface_EmptyPrivateIPAndSecondaryPrivateIPsUpdate
--- PASS: TestAccAWSInstance_primaryNetworkInterface (120.21s)
=== CONT  TestAccAWSInstance_EbsRootDevice_MultipleDynamicEBSBlockDevices
--- PASS: TestAccAWSInstance_creditSpecification_unlimitedCpuCredits_t2Tot3Taint (439.18s)
=== CONT  TestAccAWSInstance_NewNetworkInterface_EmptyPrivateIPAndSecondaryPrivateIPs
--- PASS: TestAccAWSInstance_NewNetworkInterface_PrivateIPAndSecondaryPrivateIPs (328.51s)
=== CONT  TestAccAWSInstance_EbsRootDevice_MultipleBlockDevices_ModifyDeleteOnTermination
--- PASS: TestAccAWSInstance_NewNetworkInterface_EmptyPrivateIPAndSecondaryPrivateIPsUpdate (172.60s)
=== CONT  TestAccAWSInstance_NewNetworkInterface_PublicIPAndSecondaryPrivateIPs
--- PASS: TestAccAWSInstance_NewNetworkInterface_EmptyPrivateIPAndSecondaryPrivateIPs (126.01s)
=== CONT  TestAccAWSInstance_EbsRootDevice_MultipleBlockDevices_ModifySize
--- PASS: TestAccAWSInstance_EbsRootDevice_MultipleDynamicEBSBlockDevices (204.78s)
=== CONT  TestAccAWSInstance_creditSpecification_unknownCpuCredits_t3
--- PASS: TestAccAWSInstance_EbsRootDevice_MultipleBlockDevices_ModifyDeleteOnTermination (120.94s)
=== CONT  TestAccAWSInstance_creditSpecification_unknownCpuCredits_t2
--- PASS: TestAccAWSInstance_creditSpecification_unknownCpuCredits_t3 (114.38s)
=== CONT  TestAccAWSInstance_creditSpecification_unlimitedCpuCredits
--- PASS: TestAccAWSInstance_EbsRootDevice_MultipleBlockDevices_ModifySize (150.63s)
=== CONT  TestAccAWSInstance_creditSpecification_standardCpuCredits
--- PASS: TestAccAWSInstance_creditSpecification_unknownCpuCredits_t2 (115.49s)
=== CONT  TestAccAWSInstance_creditSpecification_unspecifiedDefaultsToStandard
--- PASS: TestAccAWSInstance_NewNetworkInterface_PublicIPAndSecondaryPrivateIPs (262.47s)
=== CONT  TestAccAWSInstance_addSecurityGroupNetworkInterface
--- PASS: TestAccAWSInstance_creditSpecification_standardCpuCredits (138.31s)
=== CONT  TestAccAWSInstance_CreditSpecification_Empty_NonBurstable
--- PASS: TestAccAWSInstance_creditSpecification_unlimitedCpuCredits (148.35s)
=== CONT  TestAccAWSInstance_addSecondaryInterface
--- PASS: TestAccAWSInstance_creditSpecification_unspecifiedDefaultsToStandard (105.19s)
=== CONT  TestAccAWSInstance_EbsBlockDevice_InvalidIopsForVolumeType
--- PASS: TestAccAWSInstance_EbsBlockDevice_InvalidIopsForVolumeType (12.33s)
=== CONT  TestAccAWSInstance_blockDevices
--- PASS: TestAccAWSInstance_CreditSpecification_Empty_NonBurstable (136.24s)
=== CONT  TestAccAWSInstance_GP2WithIopsValue
--- PASS: TestAccAWSInstance_GP2WithIopsValue (11.76s)
=== CONT  TestAccAWSInstance_ipv6_supportAddressCountWithIpv4
--- PASS: TestAccAWSInstance_addSecurityGroupNetworkInterface (181.78s)
=== CONT  TestAccAWSInstance_ipv6AddressCountAndSingleAddressCausesError
--- PASS: TestAccAWSInstance_blockDevices (105.18s)
=== CONT  TestAccAWSInstance_EbsRootDevice_ModifyAll
--- PASS: TestAccAWSInstance_ipv6AddressCountAndSingleAddressCausesError (25.01s)
=== CONT  TestAccAWSInstance_ipv6_supportAddressCount
--- PASS: TestAccAWSInstance_addSecondaryInterface (178.15s)
=== CONT  TestAccAWSInstance_basic
--- PASS: TestAccAWSInstance_ipv6_supportAddressCountWithIpv4 (115.32s)
=== CONT  TestAccAWSInstance_placementGroup
--- PASS: TestAccAWSInstance_ipv6_supportAddressCount (104.01s)
=== CONT  TestAccAWSInstance_outpost
    data_source_aws_outposts_outposts_test.go:66: skipping since no Outposts Outpost found
--- SKIP: TestAccAWSInstance_outpost (2.90s)
=== CONT  TestAccAWSInstance_CreditSpecification_UnspecifiedToEmpty_NonBurstable
--- PASS: TestAccAWSInstance_basic (104.62s)
=== CONT  TestAccAWSInstance_vpc
--- PASS: TestAccAWSInstance_EbsRootDevice_ModifyAll (154.24s)
=== CONT  TestAccAWSInstance_disableApiTermination
--- PASS: TestAccAWSInstance_placementGroup (104.11s)
=== CONT  TestAccAWSInstance_sourceDestCheck
--- PASS: TestAccAWSInstance_CreditSpecification_UnspecifiedToEmpty_NonBurstable (117.51s)
=== CONT  TestAccAWSInstance_inEc2Classic
    provider_test.go:492: This test can only run in EC2 Classic, platforms available in us-east-1: ["VPC"]
--- SKIP: TestAccAWSInstance_inEc2Classic (1.56s)
=== CONT  TestAccAWSInstance_noAMIEphemeralDevices
--- PASS: TestAccAWSInstance_vpc (119.54s)
=== CONT  TestAccAWSInstance_NetworkInstanceVPCSecurityGroupIDs
=== CONT  TestAccAWSInstance_disableApiTermination
    resource_aws_instance_test.go:743: After applying this test step and performing a `terraform refresh`, the plan was not empty.
        stdout


        An execution plan has been generated and is shown below.
        Resource actions are indicated with the following symbols:
          + create

        Terraform will perform the following actions:

          # aws_instance.test will be created
          + resource "aws_instance" "test" {
              + ami                          = "ami-0aa598aa110a431df"
              + arn                          = (known after apply)
              + associate_public_ip_address  = (known after apply)
              + availability_zone            = (known after apply)
              + cpu_core_count               = (known after apply)
              + cpu_threads_per_core         = (known after apply)
              + disable_api_termination      = true
              + get_password_data            = false
              + host_id                      = (known after apply)
              + id                           = (known after apply)
              + instance_state               = (known after apply)
              + instance_type                = "m1.small"
              + ipv6_address_count           = (known after apply)
              + ipv6_addresses               = (known after apply)
              + key_name                     = (known after apply)
              + outpost_arn                  = (known after apply)
              + password_data                = (known after apply)
              + placement_group              = (known after apply)
              + primary_network_interface_id = (known after apply)
              + private_dns                  = (known after apply)
              + private_ip                   = (known after apply)
              + public_dns                   = (known after apply)
              + public_ip                    = (known after apply)
              + secondary_private_ips        = (known after apply)
              + security_groups              = (known after apply)
              + source_dest_check            = true
              + subnet_id                    = (known after apply)
              + tenancy                      = (known after apply)
              + volume_tags                  = (known after apply)
              + vpc_security_group_ids       = (known after apply)

              + ebs_block_device {
                  + delete_on_termination = (known after apply)
                  + device_name           = (known after apply)
                  + encrypted             = (known after apply)
                  + iops                  = (known after apply)
                  + kms_key_id            = (known after apply)
                  + snapshot_id           = (known after apply)
                  + volume_id             = (known after apply)
                  + volume_size           = (known after apply)
                  + volume_type           = (known after apply)
                }

              + ephemeral_block_device {
                  + device_name  = (known after apply)
                  + no_device    = (known after apply)
                  + virtual_name = (known after apply)
                }

              + metadata_options {
                  + http_endpoint               = (known after apply)
                  + http_put_response_hop_limit = (known after apply)
                  + http_tokens                 = (known after apply)
                }

              + network_interface {
                  + delete_on_termination = (known after apply)
                  + device_index          = (known after apply)
                  + network_interface_id  = (known after apply)
                }

              + root_block_device {
                  + delete_on_termination = (known after apply)
                  + device_name           = (known after apply)
                  + encrypted             = (known after apply)
                  + iops                  = (known after apply)
                  + kms_key_id            = (known after apply)
                  + volume_id             = (known after apply)
                  + volume_size           = (known after apply)
                  + volume_type           = (known after apply)
                }
            }

          # aws_subnet.test will be created
          + resource "aws_subnet" "test" {
              + arn                             = (known after apply)
              + assign_ipv6_address_on_creation = false
              + availability_zone               = "us-west-2a"
              + availability_zone_id            = (known after apply)
              + cidr_block                      = "10.1.1.0/24"
              + id                              = (known after apply)
              + ipv6_cidr_block_association_id  = (known after apply)
              + map_public_ip_on_launch         = false
              + owner_id                        = (known after apply)
              + tags                            = {
                  + "Name" = "tf-testacc-instance-8cd8o1i0nlfs"
                }
              + vpc_id                          = (known after apply)
            }

          # aws_vpc.test will be created
          + resource "aws_vpc" "test" {
              + arn                              = (known after apply)
              + assign_generated_ipv6_cidr_block = false
              + cidr_block                       = "10.1.0.0/16"
              + default_network_acl_id           = (known after apply)
              + default_route_table_id           = (known after apply)
              + default_security_group_id        = (known after apply)
              + dhcp_options_id                  = (known after apply)
              + enable_classiclink               = (known after apply)
              + enable_classiclink_dns_support   = (known after apply)
              + enable_dns_hostnames             = (known after apply)
              + enable_dns_support               = true
              + id                               = (known after apply)
              + instance_tenancy                 = "default"
              + ipv6_association_id              = (known after apply)
              + ipv6_cidr_block                  = (known after apply)
              + main_route_table_id              = (known after apply)
              + owner_id                         = (known after apply)
              + tags                             = {
                  + "Name" = "tf-testacc-instance-8cd8o1i0nlfs"
                }
            }

        Plan: 3 to add, 0 to change, 0 to destroy.
--- FAIL: TestAccAWSInstance_disableApiTermination (100.17s)
=== CONT  TestAccAWSInstance_rootInstanceStore
=== CONT  TestAccAWSInstance_sourceDestCheck
    resource_aws_instance_test.go:684: Check 1/2 error: InvalidInstanceID.NotFound: The instance ID 'i-04d9c8aa6addb3040' does not exist
        	status code: 400, request id: 4dbbb3e5-27e0-4f71-806b-b07fb5cdea6c
--- FAIL: TestAccAWSInstance_sourceDestCheck (105.54s)
=== CONT  TestAccAWSInstance_volumeTags
--- PASS: TestAccAWSInstance_noAMIEphemeralDevices (100.88s)
=== CONT  TestAccAWSInstance_atLeastOneOtherEbsVolume
--- PASS: TestAccAWSInstance_rootInstanceStore (121.54s)
=== CONT  TestAccAWSInstance_tags
--- PASS: TestAccAWSInstance_NetworkInstanceVPCSecurityGroupIDs (150.99s)
=== CONT  TestAccAWSInstance_GP2IopsDevice
--- PASS: TestAccAWSInstance_GP2IopsDevice (116.74s)
=== CONT  TestAccAWSInstance_NetworkInstanceRemovingAllSecurityGroups
--- PASS: TestAccAWSInstance_tags (154.05s)
=== CONT  TestAccAWSInstance_NetworkInstanceSecurityGroups
--- PASS: TestAccAWSInstance_volumeTags (222.03s)
=== CONT  TestAccAWSInstance_RootBlockDevice_KmsKeyArn
--- PASS: TestAccAWSInstance_atLeastOneOtherEbsVolume (238.67s)
=== CONT  TestAccAWSInstance_inDefaultVpcBySgId
2020/09/11 14:08:07 [WARN] Truncating attribute path of 0 diagnostics for TypeSet
--- PASS: TestAccAWSInstance_RootBlockDevice_KmsKeyArn (128.13s)
=== CONT  TestAccAWSInstance_EbsBlockDevice_KmsKeyArn
--- PASS: TestAccAWSInstance_NetworkInstanceSecurityGroups (150.49s)
=== CONT  TestAccAWSInstance_userDataBase64
--- PASS: TestAccAWSInstance_NetworkInstanceRemovingAllSecurityGroups (172.57s)
--- PASS: TestAccAWSInstance_inDefaultVpcBySgId (122.79s)
--- PASS: TestAccAWSInstance_EbsBlockDevice_KmsKeyArn (131.31s)
--- PASS: TestAccAWSInstance_userDataBase64 (173.97s)
FAIL
FAIL	github.com/terraform-providers/terraform-provider-aws/aws	3146.574s
FAIL
✘-1 ~/myrepos/terraform-provider-aws [bugfix/volume-tags ↓·1↑·3446|✚ 1]
14:12 $ export AWS_DEFAULT_REGION=us-west-2
✔ ~/myrepos/terraform-provider-aws [bugfix/volume-tags ↓·1↑·3446|✚ 1]
14:15 $ TF_ACC=1 go test ./aws -v -count 1 -parallel 4 -run="TestAccAWSInstance_disableApiTermination" -timeout 120m
=== RUN   TestAccAWSInstance_disableApiTermination
=== PAUSE TestAccAWSInstance_disableApiTermination
=== CONT  TestAccAWSInstance_disableApiTermination
--- PASS: TestAccAWSInstance_disableApiTermination (224.10s)
PASS
ok  	github.com/terraform-providers/terraform-provider-aws/aws	226.445s
✔ ~/myrepos/terraform-provider-aws [bugfix/volume-tags ↓·1↑·3446|✚ 1]
14:19 $ TF_ACC=1 go test ./aws -v -count 1 -parallel 4 -run="TestAccAWSInstance_sourceDestCheck" -timeout 120m
=== RUN   TestAccAWSInstance_sourceDestCheck
=== PAUSE TestAccAWSInstance_sourceDestCheck
=== CONT  TestAccAWSInstance_sourceDestCheck
--- PASS: TestAccAWSInstance_sourceDestCheck (290.01s)
PASS
ok  	github.com/terraform-providers/terraform-provider-aws/aws	292.056s
```